app/controllers/memories_controller.rb

    def create
        memories = @user.memories.create(memory_params)
---
INSERT INTO "memories" ("title", "about", "address", "city", "state", "zipcode", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

    def update
        memories=Memory.find(params[:id])
        memories.update(memory_params)
---
SELECT "memories".* FROM "memories" WHERE "memories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "memories" SET "about" = $1, "updated_at" = $2 WHERE "memories"."id" = $3  [["about", "Loved the picnic with Nunny!!!"], ["updated_at", "2020-10-23 04:52:24.872508"], ["id", 9]]

    def destroy
        memories=Memory.find(params[:id])
        memories.destroy
---
SELECT "memories".* FROM "memories" WHERE "memories"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "memories" WHERE "memories"."id" = $1  [["id", 3]]