app/controllers/notes_controller.rb

    def create
        note=Note.create(notes_params)
---
INSERT INTO "notes" ("reflection", "memory_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["reflection", "Wanted more fun"], ["memory_id", 8], ["created_at", "2020-10-23 00:31:42.540317"], ["updated_at", "2020-10-23 00:31:42.540317"]]

    def destroy
      notes=Note.find(params[:id])
      notes.destroy
---
SELECT "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 7]]