app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "avatar", "bio", "city", "state", "zipcode", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
    def create
        @user = User.create(user_params)